In [1]:
import pandas as pd
import numpy as np
from IPython.core.interactiveshell import InteractiveShell 
InteractiveShell.ast_node_interactivity = 'all' #默认为'last'

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()
string_data[0] = None
string_data.isnull()

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

0    False
1    False
2     True
3    False
dtype: bool

0     True
1    False
2     True
3    False
dtype: bool

In [3]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

0    1.0
2    3.5
4    7.0
dtype: float64

In [4]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    1    2
0  1.0  6.5  3.0

In [5]:
data.dropna(how='all')
data[4] = NA
data
data.dropna(axis=1, how='all')
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [6]:
df.fillna(0)
df.fillna({1: 0.5, 2: 0})
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.411401  0.000000  0.000000
1 -0.989576  0.000000  0.000000
2 -0.424347  0.000000 -0.520210
3 -0.022736  0.000000 -1.452225
4  0.279877  0.482088  0.130859
5 -0.865808 -1.829801 -0.118179
6 -0.620812 -0.842876 -1.430747

          0         1         2
0 -0.411401  0.500000  0.000000
1 -0.989576  0.500000  0.000000
2 -0.424347  0.500000 -0.520210
3 -0.022736  0.500000 -1.452225
4  0.279877  0.482088  0.130859
5 -0.865808 -1.829801 -0.118179
6 -0.620812 -0.842876 -1.430747

          0         1         2
0 -0.411401  0.000000  0.000000
1 -0.989576  0.000000  0.000000
2 -0.424347  0.000000 -0.520210
3 -0.022736  0.000000 -1.452225
4  0.279877  0.482088  0.130859
5 -0.865808 -1.829801 -0.118179
6 -0.620812 -0.842876 -1.430747

In [7]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.292094 -0.220485 -1.197272
1  0.158652 -0.724784  0.558900
2 -0.836376       NaN  1.963744
3  0.110014       NaN -0.857108
4  0.569954       NaN       NaN
5 -1.849316       NaN       NaN

In [8]:
df.fillna(method='ffill')
df.fillna(method='ffill', limit=2)
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

          0         1         2
0 -0.292094 -0.220485 -1.197272
1  0.158652 -0.724784  0.558900
2 -0.836376 -0.724784  1.963744
3  0.110014 -0.724784 -0.857108
4  0.569954 -0.724784 -0.857108
5 -1.849316 -0.724784 -0.857108

          0         1         2
0 -0.292094 -0.220485 -1.197272
1  0.158652 -0.724784  0.558900
2 -0.836376 -0.724784  1.963744
3  0.110014 -0.724784 -0.857108
4  0.569954       NaN -0.857108
5 -1.849316       NaN -0.857108

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [9]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data
data.duplicated()
data.drop_duplicates()
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

    k1  k2  v1
0  one   1   0
1  two   1   1

In [10]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [13]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef','Bacon','pastrami', 'honey ham', 'novalox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
meat_to_animal = { 'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow', 'corned beef': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'
}
lowercased = data['food'].str.lower()
lowercased
data['animal'] = lowercased.map(meat_to_animal)
data

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8        novalox
Name: food, dtype: object

          food  ounces animal
0        bacon     4.0    pig
1  pulled pork     3.0    pig
2        bacon    12.0    pig
3     Pastrami     6.0    cow
4  corned beef     7.5    cow
5        Bacon     8.0    pig
6     pastrami     3.0    cow
7    honey ham     5.0    pig
8      novalox     6.0    NaN

In [15]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [16]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [17]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [18]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [19]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [20]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [21]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [22]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [23]:
pd.value_counts(cats)
pd.cut(ages, [18, 26, 36, 61, 100], right=False)
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [24]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [25]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.54, 0.75], (0.75, 0.97], (0.1, 0.32], (0.32, 0.54], (0.1, 0.32], ..., (0.54, 0.75], (0.75, 0.97], (0.54, 0.75], (0.32, 0.54], (0.54, 0.75]]
Length: 20
Categories (4, interval[float64]): [(0.1, 0.32] < (0.32, 0.54] < (0.54, 0.75] < (0.75, 0.97]]

In [26]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [27]:
pieces = [x.strip() for x in val.split(',')]
pieces
first, second, third = pieces
first + '::' + second + '::' + third

['a', 'b', 'guido']

'a::b::guido'

In [28]:
'::'.join(pieces)

'a::b::guido'

In [30]:
'guido' in val

True

In [32]:
import re
text = "foobar\t baz \tqux"
re.split('\s+', text)

['foobar', 'baz', 'qux']

In [33]:
regex = re.compile('\s+')
regex.split(text)

['foobar', 'baz', 'qux']

In [34]:
regex.findall(text)

['\t ', ' \t']